# WSScript_GetPrmReal

## Description
This function must be used inside a worksheet script called by 'RunScript' worksheet formula.

```pascal
FUNCTION WSScript_GetPrmReal(paramIndex : INTEGER): REAL;
```

```python
def vs.WSScript_GetPrmReal(paramIndex):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|paramIndex|INTEGER|Zero based index of the parameter passed to the RunScript worksheet function.|

## Examples
```pascal
resultVal := WSScript_GetPrmReal(1);
```
```python
import vs

# This function must be used inside a worksheet script called by 'RunScript'
# worksheet formula.
paramIndex = 1

value = vs.WSScript_GetPrmReal(paramIndex)
vs.Message('WSScript_GetPrmReal returned: ' + str(value))
```

## See Also
VS Functions:
WSScript_GetObject
| WSScript_GetPrmInt
| WSScript_GetPrmReal
| WSScript_GetPrmStr
| WSScript_SetResStr
| WSScript_SetResReal
| WSScript_SetResImage

## Version
Availability: from Vectorworks 2016

## Category
* Worksheets